In [74]:
import boto3
import pandas as pd
import numpy as np
import psycopg2
import configparser
import mysql.connector

### NOS IDENTIFICAMOS CON AWS

In [47]:
config=configparser.ConfigParser()
config.read('config_dwtienda.cfg')

['config_dwtienda.cfg']

In [48]:
aws_rds_conn=boto3.client('rds',aws_access_key_id=config.get('IAM','ACCES_KEY'),
                           aws_secret_access_key=config.get('IAM','SECRET_ACCES_KEY'),
                           region_name='us-east-1')

### verificamos instancas de aws disponibles

In [49]:
#listando las instancias de aws
rds_instances_ids=[]
aws_response=aws_rds_conn.describe_db_instances()
for response in aws_response['DBInstances']:
    rds_instances_ids.append(response['DBInstanceIdentifier'])
print(f"instancias disponibles:{rds_instances_ids}")

instancias disponibles:['tienda-dw', 'tienda-transactional']

In [50]:
try:
    response=aws_rds_conn.create_db_instance(
                DBInstanceIdentifier=config.get('TRANSACC','DB_INSTANCE_ID'),
                DBName=config.get('TRANSACC','DB_NAME'),
                DBInstanceClass='db.t3.micro',
                Engine='mysql',
                MasterUsername=config.get('TRANSACC','DB_USER'),
                MasterUserPassword=config.get('TRANSACC','DB_PASSWORD'),
                Port=int(config.get('TRANSACC','DB_PORT')),
                PubliclyAccessible=True,
                VpcSecurityGroupIds=[config.get('VPC','SECURITY_GROUP')],
                AllocatedStorage=15
                )
    print(response)
except aws_rds_conn.exceptions.DBInstanceAlreadyExistsFault as ex:
    print("La instancia ya existe")
except Exception as ex:
    print("Error!!!",ex)

La instancia ya existe

### Obtenemos el hostname de las instancias tanto de postgresql como mysql

In [51]:
try:
    #Obteniendo el hostname de mysql de la base estrella
    instance=aws_rds_conn.describe_db_instances(DBInstanceIdentifier='tienda-dw')
    RDS_HOSTNAME=instance.get('DBInstances')[0].get('Endpoint').get('Address')
    print(RDS_HOSTNAME)
    #Obteniendo el hostname de postgres de la base transaccional
    instance2=aws_rds_conn.describe_db_instances(DBInstanceIdentifier='tienda-transactional')
    RDS_HOSTNAME_POSTGRES=instance2.get('DBInstances')[0].get('Endpoint').get('Address')
    print(RDS_HOSTNAME_POSTGRES)
except Exception as ex:
    print("Error!!!",ex)

tienda-dw.cbc4e20kwjik.us-east-1.rds.amazonaws.com
tienda-transactional.cbc4e20kwjik.us-east-1.rds.amazonaws.com

### NOS CONECTAMOS A LA BASE DE DATOS DE POSTGRS EN RDS DESDE PYTHON

In [52]:
import ddltiendaestrella
ddltiendaestrella.DDL_QUERY  #esta instruccion trae todo el archivo de qureys en un string

'\nDROP TABLE IF EXISTS dim_articulo;\nCREATE TABLE dim_articulo\n(\n sk_articulo INT NOT NULL primary key,\n codigo VARCHAR(50),\n nombre varchar(100),\n timestamp datetime\n )ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;\n\n DROP TABLE IF EXISTS dim_persona;\n CREATE TABLE dim_persona\n(\n sk_persona INT NOT NULL primary key,\n nombre varchar(100),\n timestamp datetime\n )ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;\n\nDROP TABLE IF EXISTS dim_categoria;\n CREATE TABLE dim_categoria\n(\n sk_categoria INT NOT NULL primary key,\n nombre varchar(50),\n timestamp datetime\n )ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;\n\n DROP TABLE IF EXISTS dim_dates;\n CREATE TABLE IF NOT EXISTS dim_dates (\n  date_key bigint NOT NULL,\n  full_date date DEFAULT NULL,\n  day_of_week bigint DEFAULT NULL,\n  day_num_in_month bigint DEFAULT NULL,\n  day_num_overall bigint DEFAULT NULL,\n  day_name text,\n  day_abbrev text,\n  weekday_flag text,\n  week_num_in_year bigint DEFAULT NULL,\n  week_num_overall bigint DEFAULT NULL,\n  week_begin_date date DEFAULT NULL,\n  week_begin_date_key date DEFAULT NULL,\n  month bigint DEFAULT NULL,\n  month_num_overall bigint DEFAULT NULL,\n  month_name text,\n  month_abbrev text,\n  quarter bigint DEFAULT NULL,\n  year bigint DEFAULT NULL,\n  yearmo bigint DEFAULT NULL,\n  fiscal_month bigint DEFAULT NULL,\n  fiscal_quarter bigint DEFAULT NULL,\n  fiscal_year bigint DEFAULT NULL,\n  last_day_in_month_flag text,\n  same_day_year_ago_date date DEFAULT NULL,\n  PRIMARY KEY (date_key)\n) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;\n \nDROP TABLE IF EXISTS fact_movimientos;\nCREATE TABLE IF NOT EXISTS fact_movimientos(\n   tipo int NOT NULL,\n   date_key bigint NOT NULL,\n   sk_articulo int NOT NULL,\n   sk_persona int NOT NULL,\n   sk_categoria int NOT NULL,\n   cantidad int DEFAULT NULL,\n   precio decimal(11,2) DEFAULT NULL,\n   descuento decimal(11,2) DEFAULT NULL,\n   PRIMARY KEY (tipo,date_key,sk_articulo,sk_persona,sk_categoria),\n   CONSTRAINT fk_datekey FOREIGN KEY (date_key) REFERENCES dim_dates(date_key),\n   CONSTRAINT fk_articulo FOREIGN KEY (sk_articulo) REFERENCES dim_articulo(sk_articulo),\n   CONSTRAINT fk_persona FOREIGN KEY (sk_persona) REFERENCES dim_persona(sk_persona),\n   CONSTRAINT fk_categoria FOREIGN KEY (sk_categoria) REFERENCES dim_categoria(sk_categoria)\n) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;\n \n'

### ESTE CODIGO SI DA ERROR ES PORQUE YA SE CORRIO UNA VEZ EL DDL

In [54]:
import mysql.connector
from mysql.connector import Error

try:
    db_mysql_conn = mysql.connector.connect(
                        host=RDS_HOSTNAME,
                        database=config.get('TRANSACC', 'DB_NAME'),
                        user=config.get('TRANSACC', 'DB_USER'),
                        password=config.get('TRANSACC', 'DB_PASSWORD'),
                        port=config.get('TRANSACC', 'DB_PORT')
                    )
    if db_mysql_conn.is_connected():
        cursor = db_mysql_conn.cursor()
        cursor.execute(ddltiendaestrella.DDL_QUERY)
        cursor.fetchall()  # Consumir todos los resultados pendientes
        db_mysql_conn.commit()
        print("Base de datos creada exitosamente")
except Error as e:
    print("Error:", e)
finally:
    if 'db_mysql_conn' in locals() and db_mysql_conn.is_connected():
        cursor.close()
        db_mysql_conn.close()

Error: 3730 (HY000): Cannot drop table 'dim_articulo' referenced by a foreign key constraint 'fk_articulo' on table 'fact_movimientos'.

### insertamos datos en la base de datos y es necesario instalar pip install sqlalchemy

In [41]:
# este metodo recibe el dataframe y no lo combierte en diccionario
def insertData2SQLFrame(df,table_name,driver):
    try:
        response=df.to_sql(table_name,driver,index=False,if_exists='append')
        print(f"Se han insertado {response} nuevos registros")
    except Exception as ex:
        print("Error!!",ex)

In [22]:
driver = f"mysql+mysqlconnector://{config.get('TRANSACC', 'DB_USER')}:{config.get('TRANSACC', 'DB_PASSWORD')}@{RDS_HOSTNAME}:{config.get('TRANSACC', 'DB_PORT')}/{config.get('TRANSACC', 'DB_NAME')}"
print(driver)
driver_postgres = f"""postgresql://{config.get('TRANSACC_POSTGRES', 'DB_USER')}:{config.get('TRANSACC_POSTGRES', 'DB_PASSWORD')}@{RDS_HOSTNAME_POSTGRES}:{config.get('TRANSACC_POSTGRES', 'DB_PORT')}/{config.get('TRANSACC_POSTGRES', 'DB_NAME')}"""
print(driver_postgres)

mysql+mysqlconnector://mysql_admin:p8F94pptIh43Pz26r5BgYfV4r@tienda-dw.cbc4e20kwjik.us-east-1.rds.amazonaws.com:3306/dwtienda
postgresql://postgres_admin:p8F94pptIh43Pz26r5BgYfV4r@tienda-transactional.cbc4e20kwjik.us-east-1.rds.amazonaws.com:5432/tienda

### llenando la tabla de dimensiones de articulos
se lee de la base de postgres y luego el df se inserta en mysql

In [58]:
query_postgres="select idarticulo as sk_articulo,codigo,nombre,now() as timestamp from articulo"
df_articulo=pd.read_sql(query_postgres,driver_postgres)
df_articulo.head()

   sk_articulo codigo          nombre                        timestamp
0            1   1010     LAPTOP DELL 2024-04-13 22:23:47.371372+00:00
1            2   1020       IPHONE 14 2024-04-13 22:23:47.371372+00:00
2            3   2010  LAMPARA DE PIE 2024-04-13 22:23:47.371372+00:00
3            4   2020      NACIMIENTO 2024-04-13 22:23:47.371372+00:00
4            5   3010        PODADORA 2024-04-13 22:23:47.371372+00:00

In [43]:
insertData2SQLFrame(df_articulo,'dim_articulo',driver)

Se han insertado 8 nuevos registros

### LLENANDO DIMENSION DE CATEGORIAS

In [59]:
query_postgres="select idcategoria as sk_categoria,nombre,now() as timestamp from categoria"
df_categoria=pd.read_sql(query_postgres,driver_postgres)
df_categoria.head()

   sk_categoria       nombre                        timestamp
0             1   Tecnologia 2024-04-13 22:23:54.432245+00:00
1             2        Hogar 2024-04-13 22:23:54.432245+00:00
2             3       Jardin 2024-04-13 22:23:54.432245+00:00
3             4  Carpinteria 2024-04-13 22:23:54.432245+00:00

In [60]:
insertData2SQLFrame(df_categoria,'dim_categoria',driver)

Se han insertado 4 nuevos registros

### llenando la tabla de dimensiones de tiempo
para esto tendremos que consultar las fechas de las tablas de ventas e ingresos de la transaccional

In [130]:
#trae las fechas de venta
df_fechaventa=[]
query_postgres="select fecha as full_date from venta"
df_fechaventa=pd.read_sql(query_postgres,driver_postgres)
df_fechaventa.head()
#trae las fehcas de ingreso
query_postgres="select fecha as full_date from ingreso"
df_fechaingreso=pd.read_sql(query_postgres,driver_postgres)
df_fechaingreso.head()
# Concatenar los DataFrames
df_dimfechas = pd.concat([df_fechaventa, df_fechaingreso])
df_dimfechas.head()

   full_date
0 2017-01-15
1 2016-04-23
2 2018-08-10
3 2019-02-17
4 2018-12-25

In [131]:
#eliminamos las fechas duplicadas
df_dimfechas.drop_duplicates(inplace=True)
#creo la llave de la tabla de dimension de fecha

In [144]:
# Extraer el año, mes, trimestre, día que son los unicos que me intersan para mis preguntas de negocio
df_dimfechas['year'] = pd.DatetimeIndex(df_dimfechas['full_date']).year.astype(str)
df_dimfechas['month'] = pd.DatetimeIndex(df_dimfechas['full_date']).strftime('%m').astype(str)
df_dimfechas['quarter'] = pd.DatetimeIndex(df_dimfechas['full_date']).quarter
df_dimfechas['day_num_in_month'] = pd.DatetimeIndex(df_dimfechas['full_date']).strftime('%d').astype(str)

#creo la llave de la tabla de dimension de fecha
df_dimfechas['date_key'] = df_dimfechas['year'].astype(str)+df_dimfechas['month'].astype(str)+df_dimfechas['day_num_in_month'].astype(str)

In [145]:
df_dimfechas

    full_date  year month  quarter day_num_in_month  date_key
0  2017-01-15  2017    01        1               15  20170115
1  2016-04-23  2016    04        2               23  20160423
2  2018-08-10  2018    08        3               10  20180810
3  2019-02-17  2019    02        1               17  20190217
4  2018-12-25  2018    12        4               25  20181225
..        ...   ...   ...      ...              ...       ...
94 2017-10-26  2017    10        4               26  20171026
95 2019-10-05  2019    10        4               05  20191005
96 2019-10-28  2019    10        4               28  20191028
97 2019-09-11  2019    09        3               11  20190911
99 2020-08-10  2020    08        3               10  20200810

[192 rows x 6 columns]

In [147]:
insertData2SQLFrame(df_dimfechas,'dim_dates',driver)

Se han insertado 192 nuevos registros

### Llenando la tabla de dimensiones de persona

In [148]:
query_postgres="select idpersona as sk_persona,nombre,now() as timestamp from persona"
df_persona=pd.read_sql(query_postgres,driver_postgres)
df_persona.head()

   sk_persona         nombre                        timestamp
0           1     Jose Perez 2024-04-14 01:22:04.964633+00:00
1           2  Luis Martinez 2024-04-14 01:22:04.964633+00:00
2           3    Karla Gomez 2024-04-14 01:22:04.964633+00:00
3           4       Distelsa 2024-04-14 01:22:04.964633+00:00
4           5        Intelaf 2024-04-14 01:22:04.964633+00:00

In [149]:
insertData2SQLFrame(df_persona,'dim_persona',driver)

Se han insertado 6 nuevos registros

### POBLANDO LA TABLA DE HECHO
ESTA TABLA DE HECHOS SE LLENA CON DOS TABLAS TRANSACCIONALES LA DE VENTAS Y LA DE INGRESOS
1) VAMOS A CONSTRUIR PRIMERO LA DE VENTAS

In [206]:
query_postgres="select 1 as tipo,v.fecha,dv.idarticulo as sk_articulo,art.idcategoria as sk_categoria ,v.idcliente as sk_persona,dv.cantidad,dv.precio,dv.descuento from venta v inner join detalle_venta dv  on (v.idventa=dv.idventa) inner join articulo art on (art.idarticulo=dv.idarticulo)"
df_venta=pd.read_sql(query_postgres,driver_postgres)
df_venta.head()

,tipo,fecha,sk_articulo,sk_categoria,sk_persona,cantidad,precio,descuento
0,1,2017-01-15,1,1,2,5,923.83,0.0
1,1,2016-04-23,8,4,1,5,778.58,0.0
2,1,2018-08-10,2,1,3,10,734.83,0.0
3,1,2019-02-17,5,3,1,2,500.05,0.0
4,1,2019-02-17,4,2,1,2,338.46,0.0

In [207]:
#trimestre, día que son los unicos que me intersan para mis preguntas de negocio
df_venta['year'] = pd.DatetimeIndex(df_venta['fecha']).year.astype(str)
df_venta['month'] = pd.DatetimeIndex(df_venta['fecha']).strftime('%m').astype(str)
df_venta['day_num_in_month'] = pd.DatetimeIndex(df_venta['fecha']).strftime('%d').astype(str)
df_venta['date_key'] = df_venta['year'].astype(str)+df_venta['month'].astype(str)+df_venta['day_num_in_month'].astype(str)
del df_venta['year']
del df_venta['month']
del df_venta['day_num_in_month']
del df_venta['fecha']
df_venta

,tipo,sk_articulo,sk_categoria,sk_persona,cantidad,precio,descuento,date_key
0,1,1,1,2,5,923.83,0.0,20170115
1,1,8,4,1,5,778.58,0.0,20160423
2,1,2,1,3,10,734.83,0.0,20180810
3,1,5,3,1,2,500.05,0.0,20190217
4,1,4,2,1,2,338.46,0.0,20190217
...,...,...,...,...,...,...,...,...
184,1,4,2,1,5,49.63,0.0,20180508
185,1,3,2,3,1,88.86,0.0,20200127
186,1,4,2,1,7,93.55,0.0,20200405
187,1,2,1,1,8,488.98,0.0,20200405
188,1,7,4,1,9,136.75,0.0,20200405

AHORA VAMOS A CONSTRUIR LA TABLA DE INGRESOS

In [208]:
query_postgres="select 2 as tipo,v.fecha,dv.idarticulo as sk_articulo,art.idcategoria as sk_categoria ,v.idproveedor as sk_persona,dv.cantidad,dv.precio,0 descuento from ingreso v inner join detalle_ingreso dv  on (v.idingreso=dv.idingreso) inner join articulo art on (art.idarticulo=dv.idarticulo)"
df_ingreso=pd.read_sql(query_postgres,driver_postgres)
df_ingreso.head()

,tipo,fecha,sk_articulo,sk_categoria,sk_persona,cantidad,precio,descuento
0,2,2016-09-15,7,4,6,6,6.37,0
1,2,2016-09-15,3,2,6,8,483.71,0
2,2,2019-12-04,6,3,4,3,636.13,0
3,2,2019-12-04,7,4,4,10,363.46,0
4,2,2018-07-04,1,1,5,7,630.50,0

In [209]:
#trimestre, día que son los unicos que me intersan para mis preguntas de negocio
df_ingreso['year'] = pd.DatetimeIndex(df_ingreso['fecha']).year.astype(str)
df_ingreso['month'] = pd.DatetimeIndex(df_ingreso['fecha']).strftime('%m').astype(str)
df_ingreso['day_num_in_month'] = pd.DatetimeIndex(df_ingreso['fecha']).strftime('%d').astype(str)
df_ingreso['date_key'] = df_ingreso['year'].astype(str)+df_ingreso['month'].astype(str)+df_ingreso['day_num_in_month'].astype(str)
del df_ingreso['year']
del df_ingreso['month']
del df_ingreso['day_num_in_month']
del df_ingreso['fecha']
df_ingreso

,tipo,sk_articulo,sk_categoria,sk_persona,cantidad,precio,descuento,date_key
0,2,7,4,6,6,6.37,0,20160915
1,2,3,2,6,8,483.71,0,20160915
2,2,6,3,4,3,636.13,0,20191204
3,2,7,4,4,10,363.46,0,20191204
4,2,1,1,5,7,630.50,0,20180704
...,...,...,...,...,...,...,...,...
193,2,1,1,5,2,432.31,0,20190911
194,2,6,3,5,8,515.34,0,20190911
195,2,2,1,6,3,655.91,0,20180207
196,2,2,1,6,9,397.51,0,20180207
197,2,4,2,6,9,37.56,0,20200810

AHORA UNIMOS LOS DOS DATAFRAME PARA TENER EN UNA SOLA LOS INGRESOS Y LAS VENTAS

In [210]:
# Concatenar los DataFrames
df_factmovimientos = pd.concat([df_venta, df_ingreso])
df_factmovimientos

,tipo,sk_articulo,sk_categoria,sk_persona,cantidad,precio,descuento,date_key
0,1,1,1,2,5,923.83,0.0,20170115
1,1,8,4,1,5,778.58,0.0,20160423
2,1,2,1,3,10,734.83,0.0,20180810
3,1,5,3,1,2,500.05,0.0,20190217
4,1,4,2,1,2,338.46,0.0,20190217
...,...,...,...,...,...,...,...,...
193,2,1,1,5,2,432.31,0.0,20190911
194,2,6,3,5,8,515.34,0.0,20190911
195,2,2,1,6,3,655.91,0.0,20180207
196,2,2,1,6,9,397.51,0.0,20180207
197,2,4,2,6,9,37.56,0.0,20200810

In [211]:
df_hechosagrupado = df_factmovimientos.groupby(['tipo', 'sk_categoria', 'sk_articulo', 'sk_persona', 'date_key']).agg({
    'cantidad': 'sum',
    'precio': 'sum',
    'descuento': 'sum'
}).reset_index()
df_hechosagrupado

,tipo,sk_categoria,sk_articulo,sk_persona,date_key,cantidad,precio,descuento
0,1,1,1,1,20160723,10,538.17,0.0
1,1,1,1,1,20161122,6,904.73,0.0
2,1,1,1,1,20170507,8,957.26,0.0
3,1,1,1,1,20170719,12,1060.63,0.0
4,1,1,1,1,20170806,2,788.31,0.0
...,...,...,...,...,...,...,...,...
356,2,4,8,6,20180621,8,444.20,0.0
357,2,4,8,6,20180827,8,824.89,0.0
358,2,4,8,6,20190927,8,255.28,0.0
359,2,4,8,6,20200626,1,940.92,0.0
360,2,4,8,6,20201211,10,311.10,0.0

### INSERTAMOS LA TABLA DE HECHOS

In [212]:
insertData2SQLFrame(df_hechosagrupado,'fact_movimientos',driver)

Se han insertado 361 nuevos registros